# Pandas

âš¡**there are 2 data structures in pandas** 
      

1.   **Series**
2.   **DataFrames**  âš¡

Series
--> one dimensional array holding data of any type

In [9]:
import pandas as pd

mydata = ['s','a','m','r','a','t']

mySeries = pd.Series(mydata)
print(mySeries)

0    s
1    a
2    m
3    r
4    a
5    t
dtype: object

In [24]:
# mySeriesData = (['samrat','sanjay','bruce'])
mySeriesData = {'author': 'samrat', 'nickname': 'sanjay', 'fav fiction character': 'bruce'}
mySeries2 = pd.Series(mySeriesData)
print(mySeries2)

author                   samrat
nickname                 sanjay
fav fiction character     bruce
dtype: object

In [28]:
age = pd.Series([20,21,15], name = "age")
print(age)

0    20
1    21
2    15
Name: age, dtype: int64

In [33]:
# i want to maximum value in age
print('maximum age is :', age.max())
# i want to minimum value in age
print('minimum age is :', age.min())

maximum age is : 21
minimum age is : 15

In [34]:
### it describes the all details in the array 
print(age.describe())

count     3.000000
mean     18.666667
std       3.214550
min      15.000000
25%      17.500000
50%      20.000000
75%      20.500000
max      21.000000
Name: age, dtype: float64

The describe() method provides a quick overview of the numerical data in a DataFrame.

ðŸ’ªâš¡ A Series, by contrast, is a sequence of data values. If a DataFrame is a table, a Series is a list. And in fact you can create one with nothing more than a list:*italicized text* âš¡

Dataframe --> multi dimensional array

In [19]:
df = pd.DataFrame({
    'Name':['spiderman','ironman','captain america','thor'], 
    'power':['webs','suit','shield','hammer',],
    'Avenger':['yes','yes','yes','yes']
    },
                  index = [10,20,30,40]
                  );
print(df)

               Name   power Avenger
10        spiderman    webs     yes
20          ironman    suit     yes
30  captain america  shield     yes
40             thor  hammer     yes

In [25]:
### When selecting a single column of a pandas DataFrame, the result is a pandas Series.
### To select the column, use the column label in between square brackets [].

print(df["Name"])

10          spiderman
20            ironman
30    captain america
40               thor
Name: Name, dtype: object

In [26]:
print(df["power"])

10      webs
20      suit
30    shield
40    hammer
Name: power, dtype: object

# Read data from file

In [37]:
read_file = pd.read_csv("student.csv")
print(read_file)

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [41]:
# i want to load some column and rows 

print(read_file.head(8))

# i do some conditions 

print(read_file.mark > 90)

# pandas also provides a tail() method. For example, titanic.tail(10)
#will return the last 10 rows of the DataFrame

print(read_file.tail(2))

   id         name  class  mark  gender
0   1     John Deo   Four    75  female
1   2     Max Ruin  Three    85    male
2   3       Arnold  Three    55    male
3   4   Krish Star   Four    60  female
4   5    John Mike   Four    60  female
5   6    Alex John   Four    55    male
6   7  My John Rob  Fifth    78    male
7   8       Asruid   Five    85    male
0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32     True
33    False
34    False
Name: mark, dtype: bool
    id        name  class  mark  gender
33  34    Gain Toe  Seven    69    male
34  35  Rows Noump    Six    88  female

Read file from excel sheet

In [52]:
read_file_excel = pd.read_excel("student.xlsx")
print(read_file_excel)

### sort the heads 
print(read_file_excel.name)

print(read_file_excel.head(8))

print(read_file_excel.tail(8))

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob   Five    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow    Six    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
0        John Deo
1        Max Ruin
2          Arnold
3      Krish Star
4       John Mike
5       Alex John
6     My John Rob
7          Asruid
8         Tes Qry
9        Big John
10         Ronald
11          Recky
12            Kty
13           Bigy
14       Tade Row
15          Gimmy
16          Tumyu
17          Honny
18          Tinny
19         Jackly
20     Babby John
21         Reggid
22          Herod
23      Tiddy Now
24       Giff Tow
25         Crelea
26       Big Nose
27      Rojj Base
28    Tess Played
29      Reppy Red
30    Marry Toeey
31      Binn Rott
32      Kenn Rein
33       Gain Toe
34     Rows Noump
Name: name, dtype: object
   id         name  class  mark  gender
0   1     John Deo   Four    75  female
1   2     Max Ruin  Three    85    male
2   3       Arnold  Three    55    male
3   4   Krish Star   Four    60  female
4   5    John Mike   Four    60  female
5   6    Alex John   Four    55    male
6   7  My John Rob   Five    78    male
7   8       Asruid   Five    85    male
    id         name  class  mark  gender
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [53]:
### get information from the file

print(read_file_excel.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    35 non-null     object
 2   class   35 non-null     object
 3   mark    35 non-null     int64
 4   gender  35 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB
None

In [59]:
### to select the mmultiple columns

# print(read_file_excel)
print(read_file_excel[['name','mark']])

           name  mark
0      John Deo    75
1      Max Ruin    85
2        Arnold    55
3    Krish Star    60
4     John Mike    60
5     Alex John    55
6   My John Rob    78
7        Asruid    85
8       Tes Qry    78
9      Big John    55
10       Ronald    89
11        Recky    94
12          Kty    88
13         Bigy    88
14     Tade Row    88
15        Gimmy    88
16        Tumyu    54
17        Honny    75
18        Tinny    18
19       Jackly    65
20   Babby John    69
21       Reggid    55
22        Herod    79
23    Tiddy Now    78
24     Giff Tow    88
25       Crelea    79
26     Big Nose    81
27    Rojj Base    86
28  Tess Played    55
29    Reppy Red    79
30  Marry Toeey    88
31    Binn Rott    90
32    Kenn Rein    96
33     Gain Toe    69
34   Rows Noump    88

In [65]:
# filter the data 
filter = read_file_excel[read_file_excel['mark'].isin([40])]
print(filter)

Empty DataFrame
Columns: [id, name, class, mark, gender]
Index: []

In [72]:
# filter the data from the excel file
range_From_excelFile = read_file_excel[(read_file_excel['mark'] >= 50) & (read_file_excel['mark'] <= 60)]
print(range_From_excelFile)

    id         name  class  mark  gender
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
9   10     Big John   Four    55  female
16  17        Tumyu    Six    54    male
21  22       Reggid  Seven    55  female
28  29  Tess Played  Seven    55    male